# Part 3
For part 3 of the project you will be practicing applying an E.T.L process on your previously saved movie data. Specifically, you will create a new MySQL database after preparing the data for a relational database. You will export your database to a .sql file in your repository using MySQL Workbench.

## Specifications - Database
- Your stakeholder wants you to take the data you have been cleaning and collecting in Parts 1 & 2 of the project and wants you to create a MySQL database for them.

- Specifically, they want the data from the following files included in your database:

- Title Basics:
    - Movie ID (tconst)
    - Primary Title
    - Start Year
    - Runtime (in Minutes)
    - Genres

- Title Ratings
    - Movie ID (tconst)
    - Average Movie Rating
    - Number of Votes

- The TMDB API Results (multiple files)
    - Movie ID
    - Revenue
    - Budget
    - Certification (MPAA Rating)

- You should normalize the tables as best you can before adding them to your new database.

    - Note: an important exception to their request is that they would like you to keep all of the data from the TMDB API in 1 table together (even though it will not be perfectly normalized).
    - You only need to keep the imdb_id, revenue, budget, and certification columns

## Required Transformation Steps for Title Basics:
- Normalize Genre:

    - Convert the single string of genres from title basics into 2 new tables.
        1. title_genres: with the columns:

            - tconst
            - genre_id
        2. genres:

            - genre_id
            - genre_name
            
- Discard unnecessary information:

    - For the title basics table, drop the following columns:
          
        - "original_title" (we will use the primary title column instead)
        - "isAdult" ("Adult" will show up in the genres so this is redundant information).
        - "titleType" (every row will be a movie).
        - "genres" and other variants of genre (genre is now represented in the 2 new tables described above.
    - Do not include the title_akas table in your SQL database.
        - You have already filtered out the desired movies using this table, and the remaining data is mostly nulls and not of interest to the stakeholder.

## MySQL Database Requirements
   
   - Use sqlalchemy with Pandas to execute your SQL queries inside your notebook.

    - Create a new database on your MySQL server and call it "movies."

    - Make sure to have the following tables in your "movies" database:
    
        - title_basics
        - title_ratings
        - title_genres
        - genres
        - tmdb_data

  - Make sure to set a Primary Key for each table that isn't a joiner table (e.g., title_genres is a joiner table).
   
  - After creating each table, show the first 5 rows of that table using a SQL query.

  - Make sure to run the "SHOW TABLES" SQL query at the end of your notebook to show that all required tables have been created.

## Import Libraries

In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\melissa\anaconda3\envs\dojo-env\lib\site-packages (8.0.33)
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in c:\users\melissa\anaconda3\envs\dojo-env\lib\site-packages (from mysql-connector-python) (3.20.1)

In [2]:
# Imports
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import json

import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy.types import *
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy import create_engine
import mysql.connector

## Normalize genres

### title_basics Dataframe

In [3]:
# Load the dataframe from the csv file
title_basics_df = pd.read_csv('Data/title_basics.csv.gz')

In [4]:
# Display the first (5) rows
title_basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,118,"Comedy,Fantasy,Romance"
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013.0,120,"Drama,History"
2,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,70,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,122,Drama
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,100,"Comedy,Horror,Sci-Fi"

In [5]:
type('genres')

str

- We are going to convert these strings into lists of strings into a new 'genres_split' column.

In [6]:
# Convert strings into lists of strings in a new 'genres_split' column
title_basics_df['genres_split'] = title_basics_df['genres'].str.split(',')

In [7]:
title_basics_df['genres_split']

0           [Comedy, Fantasy, Romance]
1                     [Drama, History]
2                              [Drama]
3                              [Drama]
4             [Comedy, Horror, Sci-Fi]
                     ...
81798                          [Drama]
81799         [Comedy, Drama, Fantasy]
81800                          [Drama]
81801    [Action, Adventure, Thriller]
81802                 [Drama, History]
Name: genres_split, Length: 81803, dtype: object

In [8]:
# Display the first (2) rows
title_basics_df.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013.0,120,"Drama,History","[Drama, History]"

- We will then use .explode() to separate the list of genres into new rows: one row for each genre a movie belonged to.

In [9]:
# Create a new dataframe with a row
# for each genre a movie belongs to by using .explode
exploded_genres_df = title_basics_df.explode('genres_split')

In [10]:
# Display the first (2) rows
exploded_genres_df.head(10)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,118,"Comedy,Fantasy,Romance",Romance
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013.0,120,"Drama,History",Drama
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013.0,120,"Drama,History",History
2,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,70,Drama,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,122,Drama,Drama
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,100,"Comedy,Horror,Sci-Fi",Comedy
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,100,"Comedy,Horror,Sci-Fi",Horror
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,100,"Comedy,Horror,Sci-Fi",Sci-Fi

- Finally, use .unique() to get the unique genres from the genres_split column

In [11]:
# Create a list of unique genres from the genres_split column
unique_genres = sorted(exploded_genres_df['genres_split'].unique())

In [12]:
# Display the list of unique genres
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [13]:
len(unique_genres)

25

### Create a new title_genres table

-  Create a new title_genres from the exploded df.
    - We only want the tconst and genres_split columns

In [14]:
# Save just tconst and genres_split as a new df
title_genres_df = exploded_genres_df[['tconst', 'genres_split']].copy()

In [15]:
# Display the first (5) rows
title_genres_df.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0043139        Drama
1  tt0043139      History

### Create a genre mapper dictionary to replace string genres with integers

In [16]:
# Make a dictionary
# with list of unique genres as the key and the new integer id as values
genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))

In [17]:
# Display the genre_id_map dictionary
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

### Replace the string genres in title_genres with the new integer ids.
- Create a new genre_id column using the genre_map dictionary with either .map or .replace.
- Next, drop the "genres_split" column.
- The title_genres table is now ready for the MySQL database

In [18]:
# Create a genre_id column using the genre_map dictionary with .map
title_genres_df['genre_id'] = title_genres_df['genres_split'].map(genre_id_map)
# Drop the "genres_split" column
title_genres_df = title_genres_df.drop(columns='genres_split')

In [19]:
# Display the first (5) rows
title_genres_df.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0043139         7
1  tt0043139        11

### Convert the genre map dictionary into a dataframe

In [20]:
# Create a dataframe from the genre_map dictionary with .map
genres_df = pd.DataFrame({'genre_name': genre_id_map.keys(),
                           'genre_id': genre_id_map.values()})

In [21]:
# Display the first (5) rows
genres_df.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## Create SQL Movies Database

In [22]:
with open('C:/Users/Melissa/.secret/mysql.json') as f:
    login = json.load(f)

# Display the MySQL login keys
login.keys()

dict_keys(['username', 'password'])

In [23]:
# Create a connection string using credentials following this format:
# connection = "dialect+driver://username:password@host:port/database"
database_name = "Movies"
connection_str = f"mysql+pymysql://{login['username']}:{login['password']}@localhost/{database_name}"

In [24]:
# Create an instance of the sqlalchemy Engine Class 
engine = create_engine(connection_str)

In [25]:
# Create the Movies database, if it does not already exist
if database_exists(connection_str) == False: create_database(connection_str)
else: print('The database already exists.')

The database already exists.

### Create SQL Tables

#### title_basics SQL Table

In [26]:
# Display the first (5) rows
title_basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013.0,120,"Drama,History","[Drama, History]"
2,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,70,Drama,[Drama]
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,122,Drama,[Drama]
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"

In [27]:
# Display the names, non-null values, and datatypes for the columns
title_basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81803 entries, 0 to 81802
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81803 non-null  object
 1   titleType       81803 non-null  object
 2   primaryTitle    81803 non-null  object
 3   originalTitle   81803 non-null  object
 4   isAdult         81803 non-null  int64
 5   startYear       81803 non-null  float64
 6   runtimeMinutes  81803 non-null  int64
 7   genres          81803 non-null  object
 8   genres_split    81803 non-null  object
dtypes: float64(1), int64(2), object(6)
memory usage: 5.6+ MB

In [28]:
# Drop columns from the dataframe
title_basics_df = title_basics_df.drop(columns = ['titleType', 'originalTitle',
                                                  'isAdult','genres', 'genres_split'])

In [29]:
# Display the names, non-null values, and datatypes for the columns
title_basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81803 entries, 0 to 81802
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81803 non-null  object
 1   primaryTitle    81803 non-null  object
 2   startYear       81803 non-null  float64
 3   runtimeMinutes  81803 non-null  int64
dtypes: float64(1), int64(1), object(2)
memory usage: 2.5+ MB

#### Converting df to SQL Table

In [30]:
# Calculate max string lengths for object columns
key_len = title_basics_df['tconst'].fillna('').map(len).max()
title_len = title_basics_df['primaryTitle'].fillna('').map(len).max()

# Use 1 + the max_str_len for object columns ('tconst' and 'primaryTitle') 
# Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    'tconst': String(key_len+1), 
    'primaryTitle': Text(title_len+1),
    'startYear': Integer(),
    'runtimeMinutes': Integer()}

In [31]:
# Save the dataframe to an sql table
# with appropriate datatypes and set index=False
title_basics_df.to_sql('title_basics',
              engine, 
              dtype=df_schema,
              if_exists='replace',
              index=False)

81803

In [32]:
# Use the sqlalchemy engine to update the table, and 
# set the desired column as the primary key
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [33]:
q = """SELECT * FROM title_basics LIMIT 5;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0043139,Life of a Beijing Policeman,2013,120
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
3,tt0069049,The Other Side of the Wind,2018,122
4,tt0088751,The Naked Monster,2005,100

In [34]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0     title_basics

 ### title_ratings SQL Table

In [35]:
# Load the dataframe from the csv file
title_ratings_df = pd.read_csv('Data/title_ratings.csv.gz')

In [36]:
# Display the first (5) rows
title_ratings_df.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1982
1  tt0000002            5.8       265
2  tt0000005            6.2      2625
3  tt0000006            5.1       182
4  tt0000007            5.4       820

In [37]:
# Display the names, non-null values, and datatypes for the columns
title_ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 502108 entries, 0 to 502107
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         502108 non-null  object
 1   averageRating  502108 non-null  float64
 2   numVotes       502108 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.5+ MB

In [38]:
# Calculate max string lengths for object columns
key_len = title_ratings_df['tconst'].fillna('').map(len).max()

# Use 1 + the max_str_len for object columns
# Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [39]:
# Save the dataframe to an sql table
# with appropriate datatypes and set index=False
title_ratings_df.to_sql('title_ratings',
              engine, 
              dtype=df_schema,
              if_exists='replace',
              index=False)

502108

In [40]:
# Use the sqlalchemy engine to update the table, and 
# set tconst as the primary key
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [41]:
# Display the first 5 rows of the table using a SQL query
q = """
SELECT * 
FROM title_ratings LIMIT 5
;"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1982
1  tt0000002            5.8       265
2  tt0000005            6.2      2625
3  tt0000006            5.1       182
4  tt0000007            5.4       820

In [42]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0     title_basics
1    title_ratings

 ### title_genres SQL Table

In [43]:
# Display the first (5) rows
title_genres_df.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0043139         7
1  tt0043139        11

In [44]:
# Display the names, non-null values, and datatypes for the columns
title_genres_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 153290 entries, 0 to 81802
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   tconst    153290 non-null  object
 1   genre_id  153290 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.5+ MB

In [45]:
# Calculate max string lengths for object columns
tconst_len = title_genres_df['tconst'].fillna('').map(len).max()

# Use 1 + the max_str_len for object columns
# Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(tconst_len+1), 
    'genre_id':Integer()}

In [46]:
# Save the dataframe to an sql table
# with appropriate datatypes and set index=False
title_genres_df.to_sql('title_genres',
              engine, 
              dtype=df_schema,
              if_exists='replace',
              index=False)

153290

In [47]:
# Display the first 5 rows of the table using a SQL query
q = """
SELECT * 
FROM title_genres LIMIT 5
;"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0043139         7
4  tt0043139        11

### genres SQL Table

In [48]:
# Display the first (5) rows
genres_df.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [49]:
# Display the names, non-null values, and datatypes for the columns
genres_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   genre_name  25 non-null     object
 1   genre_id    25 non-null     int64
dtypes: int64(1), object(1)
memory usage: 528.0+ bytes

In [50]:
# Calculate max string lengths for object columns
genre_name_len = genres_df['genre_name'].fillna('').map(len).max()

# Use 1 + the max_str_len for object columns 
# Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "genre_id": Integer(), 
    'genre_name': String(genre_name_len+1)}

In [51]:
# Save the dataframe to an sql table
# with appropriate datatypes and set index=False
genres_df.to_sql('genres',
              engine, 
              dtype=df_schema,
              if_exists='replace',
              index=False)

25

In [52]:
# Use the sqlalchemy engine to update the table and set genre_id as the primary key
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

In [53]:
# Display the first 5 rows of the table using an SQL query
q = """
SELECT * 
FROM genres LIMIT 5
;"""
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

### tmdb_data SQL Table

In [ ]:
# Load the dataframe from the csv file
tmdb_data_df = pd.read_csv('Data/tmdb_results_combined.csv.gz')